/* Strict mode is enabled by default in ES6

Этот режим предназначен для того, 
чтобы помочь разработчикам писать безопасный код. 

В строгом режиме,
 вы не можете использовать необъявленные переменные.

Например, если вы попытаетесь присвоить значение переменной,
которая не была объявлена, вы получите ошибку. 
    
Это помогает предотвратить ошибки и улучшает безопасность кода.

Чтобы отключить строгий режим, вы можете использовать строку "use strict" в начале файла или функции.
*/


// "use strict";

// x = 3.14; // This will cause an error because x is not declared



// let i, j;

// loop1: for (i = 0; i < 3; i++) {
//   loop2: for (j = 0; j < 3; j++) {
//     if (i === 1 && j === 1) {
//       break loop1;
//     }
//     console.log(`i = ${i}, j = ${j}`);
//   }
// }




